{
  "Mike": [
    {
      "id": 1,
      "title": "Bonjour Mike, la Terre à besoin de vous! La polution est les guerres ont detruit ses ressources elle est au bord du gouffre! Son seul espoire réside en vous et votre précieuse cargaison, 1000 futur arbres attende d'être planter sur Mars arriverai vous à votre destination avec tout les arbres?",
      "actions": [
        {
          "title": "continuer",
          "to": 2
        }
      ]
    },
    {
      "id": 2,
      "title": "Votre vaisseaux est trop lourd, vous risquer de ne pas rejoindre l'atmosphère comme ça! Voulez vous lacher un panneau solaire cependant sont rôle est essentiel pour votre énergie!",
      "actions": [
        {
          "title": "Lacher un panneau solaire",
          "to": 3
        },
        {
          "title": "Continuer comme ça",
          "to": "lose"
        }
      ]
    },
    {
      "id": 3,
      "title": "Vous avez enfin quitté l'atmosphère, lacher le panneau solaire etait uen bonne decision à vous maintenant d'économiser votre energie",
      "actions": [
        {
          "title": "continuer",
          "to": 4
        }
      ]
    },
    {
      "id": 4,
      "title": "un sifflement proviens de l'arrière du vaissaux mais des meteorites peuvent surgir allez voir le bruit si vous laissez le pilote automatique vous perdez de l'energie qui est precieuse",
      "actions": [
        {
          "title": "rester au poste de pilotage",
          "to": "lose"
        },
        {
          "title": "allez voir en laissant le pilotage automatique",
          "to": 5
        },
        {
          "title": "allez voir sans le pilotage automatique",
          "to": 6
        }
      ]
    },
    {
      "id": 5,
      "title": "votre reservoir d'air a une fuite vous mettez une rustine cela devrait tenir un moment",
      "actions": [
        {
          "title": "continuer",
          "to": 7
        }
      ]
    },
    {
      "id": 6,
      "title": "votre reservoir d'air a une fuite vous mettez une rustine cela devrait tenir un moment, cependant sans pilote automatique une meteorite a toucher votre vaisseaux 50 de vos arbres sont perdu..",
      "actions": [
        {
          "title": "continuer",
          "to":
        }
      ]
    },
    {
      "id": 7,
      "title": "vous reprenez le contrôle du vaisseau mais vous êtes en difficulté et vous décidez soit d'avorter la mission et de revenir sur terre ou de continuer mais sans la certitude d'arriver sur la mars.",
      "actions": [
        {
          "title": "retour sur Terre",
          "to": 8
        },
        {
          "title": "continuer",
          "to":
        }
      ]
    },
    {
      "id": 8,
      "title": "",
      "actions": [
        {}
      ]
    }
  },
  "3": {
    "title": ,
    "title": ,
    "buttonA": ,
    "idA": ,
    "cargaison": ,
  },
  "3": {
    "title": ,
    "title": ,
    "buttonA": ,
    "idA": ,
    "cargaison": ,
  },
  "3": {
    "title": ,
    "title": ,
    "buttonA": ,
    "idA": ,
    "cargaison": ,
  },
  "3": {
    "title": ,
    "title": ,
    "buttonA": ,
    "idA": ,
    "cargaison": ,
  },
  "3": {
    "title": ,
    "title": ,
    "buttonA": ,
    "idA": ,
    "cargaison": ,
  },
  "3": {
    "title": ,
    "title": ,
    "buttonA": ,
    "idA": ,
    "cargaison": ,
  },
  