{
  "steps": [
    {
      "id": 1,
      "title": "Bonjour Mike, la Terre à besoin de vous! La pollution est les guerres ont détruit ses ressources elle est au bord du gouffre! Son seul espoirs réside en vous et votre précieuse cargaison, 1000 futur arbres attende d'être planter sur Mars arriverai vous à votre destination avec tout les arbres?",
      "background": "../assets/image/intro.png",
      "actions": [
        {
          "title": "Continuer",
          "to": 2
        }
      ]
    },
    {
      "id": 2,
      "title": "Votre vaisseaux est trop lourd, vous risquer de ne pas rejoindre l'atmosphère comme ça! Voulez vous lâcher un panneau solaire cependant sont rôle est essentiel pour votre énergie!",
      "actions": [
        {
          "title": "Lâcher un panneau solaire",
          "to": 3
        },
        {
          "title": "Continuer comme ça",
          "to": 14
        }
      ]
    },
    {
      "id": 3,
      "title": "Vous avez enfin quitté l'atmosphère, lâcher le panneau solaire était une bonne décision à vous maintenant d'économiser votre énergie",
      "actions": [
        {
          "title": "Continuer",
          "to": 4
        }
      ]
    },
    {
      "id": 4,
      "title": "un sifflement proviens de l'arrière du vaisseau mais des météorites peuvent surgir allez voir le bruit si vous laissez le pilote automatique vous perdez de l'énergie qui est précieuse",
      "actions": [
        {
          "title": "Rester",
          "to": 15
        },
        {
          "title": "Partir avec pilote",
          "to": 5
        },
        {
          "title": "Partir sans pilote",
          "to": 6
        }
      ]
    },
    {
      "id": 5,
      "title": "votre réservoir d'air a une fuite vous mettez une rustine cela devrait tenir un moment",
      "actions": [
        {
          "title": "continuer",
          "to": 10
        }
      ]
    },
    {
      "id": 6,
      "title": "votre réservoir d'air a une fuite vous mettez une rustine cela devrait tenir un moment, cependant sans pilote automatique une météorite a toucher votre vaisseaux 50 de vos arbres sont perdu..",
      "actions": [
        {
          "title": "continuer",
          "to": 7
        }
      ]
    },
    {
      "id": 7,
      "title": "votre voyage arrive à sa moitié, la rustine que vous avez installé ne vas plus tenir, voulez vous arrêter sur un satellite récupérer des pièces",
      "actions": [
        {
          "title": "partir sur le satellite",
          "to": 8
        }
      ]
    },
    {
      "id": 8,
      "title": "votre escapade sur le satellite était une bonne idée vous arriver enfin au abord de mars, vous commencez votre descente mais le manque d'énergie commence à ce faire sentir. Voulez bous lâcher des arbres pour consommer moins?",
      "actions": [
        {
          "title": "Oui",
          "to": 9
        },
        {
          "title": "Non",
          "to": "lose"
        }
      ]
    },
    {
      "id": 9,
      "title": "il ne vous reste plus que 400 arbres mais vous êtes arrivé! Vous commencé à planter les arbres l'avenir de l'humanité est sauf grâce à vous!",
      "actions": [
        {
          "title": "Fin",
          "to": "win"
        }
      ]
    },
    {
      "id": 10,
      "title": "Vous êtes à la moitié du voyage mais l'énergie commence à faire cruellement défaut à cette vitesse la vous serai bientôt à cours! Voulez vous utiliser un trou de verre pour raccourcir votre voyage c'est très risqué!",
      "actions": [
        {
          "title": "oui",
          "to": 11
        },
        {
          "title": "non",
          "to": "lose"
        }
      ]
    },
    {
      "id": 11,
      "title": "Le troue de verre déforme votre vaisseau mais vous réussissez enfin à l'orbite de mars! Vous commencez votre descente la pression ce fait de plus en plus forte, voulez vous éjecter un module et envoyer les arbres seul au risque de tout perdre ou abandonner quelques arbres? ",
      "actions": [
        {
          "title": "module",
          "to": 12
        },
        {
          "title": "lâcher des arbres",
          "to": 13
        },
        {
          "title": "rien faire",
          "to": "lose"
        }
      ]
    },
    {
      "id": 12,
      "title": "Vous arriver sur mars vos arbres ont atterris proche de vous aucun n'a était détruit c'est une réussite parfaite!!!",
      "actions": [
        {
          "title": "continuer",
          "to": "win"
        }
      ]
    },
    {
      "id": 13,
      "title": "Vous arriver sur mars mais il ne vous reste plus que 500 arbres l'avenir de l'humanité est sauf!",
      "actions": [
        {
          "title": "continuer",
          "to": "win"
        }
      ]
    },
    {
      "id": 14,
      "title": "stabiliser l'appareil deviens de plus en plus dur, finalement y a trop de poîd votre vaisseaux s'écrase",
      "actions": [
        {
          "title": "Continuer",
          "to": "lose"
        }
      ]
    },
    {
      "id": 15,
      "title": "alors que vous poursuivez votre voyage tranquillement, vous commencez à avoir du mal à respirer ce n'était pas juste une petit fuite, vous mourrez d'asphyxie et avec vous les espoirs de l'humanité",
      "actions": [
        {
          "title": "Continuer",
          "to": "lose"
        }
      ]
    },
    {
      "id": 16,
      "img": "/assets/img/1(base).png",
      "title": "Bonjour Sarah, la Terre à besoin de vous! La pollution est les guerres ont détruit ses ressources elle est au bord du gouffre! Son seul espoir réside en vous et votre précieuse cargaison, 1000 futur arbres attende d'être planter sur Mars arriverai vous à votre destination avec tout les arbres?",
      "actions": [
        {
          "title": "continuer",
          "to": 17
        }
      ]
    },
    {
      "id": 17,
      "title": "Votre vaisseaux est trop lourd, vous risquer de ne pas rejoindre l'atmosphère comme ça! Voulez vous lâcher un panneau solaire cependant sont rôle est essentiel pour votre énergie!",
      "actions": [
        {
          "title": "Lâcher un panneau solaire",
          "to": 18
        },
        {
          "title": "Continuer comme ça",
          "to": "lose"
        }
      ]
    },
    {
      "id": 18,
      "title": "Vous avez enfin quitté l'atmosphère, lâcher le panneau solaire était une bonne décision à vous maintenant d'économiser votre énergie",
      "actions": [
        {
          "title": "continuer",
          "to": 19
        }
      ]
    },
    {
      "id": 19,
      "title": "Un sifflement proviens de l'arrière du vaisseau mais des météorites peuvent surgir allez voir le bruit si vous laissez le pilote automatique vous perdez de l'énergie qui est précieuse",
      "actions": [
        {
          "title": "rester",
          "to": "lose"
        },
        {
          "title": "partir avec pilote",
          "to": 20
        },
        {
          "title": "partir sans le pilote",
          "to": 23
        }
      ]
    },
    {
      "id": 20,
      "title": "C'était un problème du au générateur du générateur d'énergie, mais vous n'avais pas les outils pour le réparer, vous devez déconnecter irréversiblement soit les capteurs de proximité ou bien le gps et piloter à vue pour économiser de l'énergie.",
      "actions": [
        {
          "title": "Capteurs de proximité",
          "to": 21
        },
        {
          "title": "Instrumentalisation GPS",
          "to": 22
        }
      ]
    },
    {
      "id": 23,
      "title": "C'était un problème du au générateur du générateur d'énergie, mais vous n'avais pas les outils pour le réparer, vous avez donc pris la bonne décision de ne pas laisser le pilote automatique pour économiser l'énergie",
      "actions": [
        {
          "title": "retourner au poste de pilotage",
          "to": 24
        }
      ]
    },
    {
      "id": 21,
      "title": "Il vous reste encore plusieurs mois de voyage et les premières conséquences de vos choix se font ressentir, le train d'atterrissage et le stockage d'arbre à été endommagé suite à une collision avec des astéroïdes que vous n'avez pas pu anticiper sans le gps",
      "actions": [
        {
          "title": "continuer",
          "to": 25
        }
      ]
    },
    {
      "id": 22,
      "title": "Il vous reste encore plusieurs mois de voyage et les premières conséquences de vos choix se font ressentir, vous savez que pour atterrir sur mars le pilote automatique ne pourra pas vous assurer un bon atterrissage",
      "actions": [
        {
          "title": "continuer",
          "to": 26
        }
      ]
    },
    {
      "id": 24,
      "title": "Il vous reste encore plusieurs mois de voyage et vous commencer à vous sentir très seul, l'espace devant vous est infini, vous ne savez plus quand il fait jour ou nuit, pour vous occuper vous écrivez énormément en espérant qu'on retrouve vos écris un jour",
      "actions": [
        {
          "title": "continuer",
          "to": 27
        }
      ]
    },
    {
      "id": 25,
      "title": "5 mois se sont écoulés, vous observez mars depuis le cockpit. Il faut maintenant se préparer à l’atterrissage. Vous change de direction pour vous mettre en orbite autour de la planète.",
      "actions": [
        {
          "title": "continuer",
          "to": 28
        }
      ]
    },
    {
      "id": 26,
      "title": "5 mois se sont écoulés, vous observez mars depuis le cockpit. Il faut maintenant se préparer à l’atterrissage. Vous change de direction pour vous mettre en orbite autour de la planète. Sans connaitre les distance entre vous et Mars vous vous faite happer par la gravité de la planète et vous vous écrasez contre le sol martien",
      "actions": [
        {
          "title": "Houston à Mars23, Vous me recevez ?!!!",
          "to": "lose"
        }
      ]
    },
    {
      "id": 27,
      "title": "5 mois se sont écoulés, vous observez mars depuis le cockpit. Il faut maintenant se préparer à l’atterrissage. Vous change de direction pour vous mettre en orbite autour de la planète. Vous signez votre premier livre -À travers les étoiles- ",
      "actions": [
        {
          "title": "continuer",
          "to": 29
        }
      ]
    },
    {
      "id": 28,
      "title": "Vous lancez la phase d'atterrissage, sans train d'atterrissage, il faudra relancer les propulseurs juste avant de toucher le sol pour diminuer la vitesse du vaisseau",
      "actions": [
        {
          "title": "Les relancer à 60% à 1000m",
          "to": 30
        },
        {
          "title": "Les relancer à 85% à 670m",
          "to": 31
        }
      ]
    },
    {
      "id": 29,
      "title": "Vous lancez la phase d'atterrissage sur Mars, pour ne pas être trop lourd vous avez le choix de lâcher la moitié de la cargaison et assurer votre atterrissage ou tenter de le faire avec tout les arbres",
      "actions": [
        {
          "title": "Assurer",
          "to": 32
        },
        {
          "title": "Prendre le risque",
          "to": 33
        }
      ]
    },
    {
      "id": 30,
      "title": "Vous arrivez à vous stabiliser puis vous avez assez de distance pour diminuer petit à petit la puissance des propulseur, vous atterrissez difficilement et mais vous vous en sortez. vous commencez à installer une base provisoire",
      "actions": [
        {
          "title": "Houston à Mars23, bravo !",
          "to": "win"
        }
      ]
    },
    {
      "id": 31,
      "title": "Vous perdez le contrôle en activant trop fort les propulseur et vous finissez par vous écraser sur Mars",
      "actions": [
        {
          "title": "Houston la mission est un échec",
          "to": "lose"
        }
      ]
    },
    {
      "id": 32,
      "title": "Vous atterrissez avec la moitié des arbres, c'est une réussite, vous commencez à vous installer. Votre livre sera publié après que vous ayez envoyé les scans à la nasa.",
      "actions": [
        {
          "title": "Bravo vous avez réussit",
          "to": "win"
        }
      ]
    },
    {
      "id": 33,
      "title": "Vous atterrissez non sans mal, avec tout les arbres, c'est une réussite complète, vous commencé à vous installer. Votre livre sera publié après que vous ayez envoyé les scans à la nasa.",
      "actions": [
        {
          "title": "C'est une formidable réussite",
          "to": "win"
        }
      ]
    }
  ]
}